Revit 2027 API
StructuralAsset.Equals(StructuralAsset) Method
 Determines whether this structural asset is equal to another.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool Equals(
	StructuralAsset other
)
Public Function Equals (
	other As StructuralAsset
) As Boolean
public:
bool Equals(
	StructuralAsset^ other
)
member Equals :
        other : StructuralAsset -> bool
Parameters
other StructuralAsset
 The structural asset with which to compare this structural asset.
Return Value
Boolean
 True if the given structural asset is equal to this one, otherwise false.
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
See Also
Reference
StructuralAsset Class
Equals Overload
Autodesk.Revit.DB Namespace